<h1> <center>Operação Matemática </center> </h1>

<h3> <i>• Importar Documento Excel</i> </h3>

In [12]:
import pandas as pd
dataset = pd.read_excel('Soma_Contagem_Máximo_Mínimo.xlsx')
display(dataset)

  PRODUTO  QTD  VALOR
0       A    2   19.5
1       B    3   23.4
2       C    1   33.0
3       D    4   42.0
4       E    5   19.9
5       F    1   59.9

<h3> <i>• Multiplicar Valores da Coluna</i> </h3>

In [13]:
dataset['TOTAL'] = dataset['QTD'] * dataset['VALOR']
display(dataset)

  PRODUTO  QTD  VALOR  TOTAL
0       A    2   19.5   39.0
1       B    3   23.4   70.2
2       C    1   33.0   33.0
3       D    4   42.0  168.0
4       E    5   19.9   99.5
5       F    1   59.9   59.9

<h3> <i>• Valor Máximo  </i> </h3>

In [35]:
#Maior Total (Melhor venda)
dataset['TOTAL'].max()

168.0

<h3> <i>• Valor Mínimo </i> </h3>

In [36]:
#Menor Valor (Valor Mais barato)
dataset['VALOR'].min()

19.5

<h3> <i>• Contar </i> </h3>

In [37]:
#Total de Produtos
dataset['PRODUTO'].count()

# ou  dataset.count()

6

<h3> <i>• Somar </i> </h3>

In [38]:
# SOMAR QTD (Total de Quantidade)
dataset['QTD'].sum()

16

In [30]:
dataset.describe()

            QTD      VALOR       TOTAL
count  6.000000   6.000000    6.000000
mean   2.666667  32.950000   78.266667
std    1.632993  15.815277   49.992546
min    1.000000  19.500000   33.000000
25%    1.250000  20.775000   44.225000
50%    2.500000  28.200000   65.050000
75%    3.750000  39.750000   92.175000
max    5.000000  59.900000  168.000000